# 2. Напишите программу, которая на вход принимает 5 чисел и находит максимальное из них.
#  Примеры:
#  - 1, 4, 8, 7, 5 -> 8
# - 78, 55, 36, 90, 2 -> 90

a = int(input('Введите а = '))
b = int(input('Введите b = '))
c = int(input('Введите c = '))
d = int(input('Введите d = '))
e = int(input('Введите e = '))

print(f"Максимальное число {max(a, b, c, d, e)}")